using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Text.RegularExpressions;

namespace _01b
{
    //Напишите регулярное выражения для даты и времени в промежутке с 6 марта 1237
    //12:00 по 27 февраля 1978 21:35 в формате MM/DD/YYYY HH:MM
    class Program
    {
        static void Main(string[] args)
        {
            // январь, март, май, июль, август, октябрь, декабрь - 31
            // апрель, июнь, сентябрь, ноябрь - 30
            // февпаль 28-29(висосотные года)
            //год является високосным в двух случаях: либо он кратен 4, но при этом не кратен 100, либо кратен 400.
            //Год не является високосным, если он не кратен 4, либо он кратен 100, но при этом не кратен 400.

            StringBuilder NonVis = new StringBuilder();
            StringBuilder Vis = new StringBuilder();
            bool f;
            for(int i = 1238; i < 1978; i++)
            {
                f = false;
                if (i % 4 == 0)
                {
                    if (i % 100 == 0)
                    {
                        if (i % 400 == 0)
                        {
                            f = true;
                        }
                        
                    }
                    else
                    {
                        f = true;
                    }

                }
                if (!f)
                {
                    NonVis.Append(i);
                    NonVis.Append("|");
                }
                else
                {
                    Vis.Append(i);
                    Vis.Append("|");
                }
            }
            NonVis.Remove(NonVis.Length - 1, 1);
            Vis.Remove(Vis.Length - 1, 1);
            //Console.WriteLine(NonVis);
            //Console.WriteLine("*********");
            //Console.WriteLine(Vis);

            // середина
            Regex r = new Regex($@"(?:(?:(?:(?:(?:01|03|05|07|08|10|12)/(?:0[1-9]|[1-2][0-9]|30|31))|(?:(?:04|06|09|11)/(?:0[1-9]|[1-2][0-9]|30)))/(?:{NonVis.ToString()}|{Vis.ToString()}))|(?:02/(0[1-9]|1[0-9]|2[0-8])/(?:{NonVis.ToString()}))|(?:02/(?:0[1-9]|[1-2][0-9])/(?:{Vis.ToString()})) (?:[0-1][0-9]|2[0-3]):[0-5][0-9])");
            
            // левая граница
            Regex r4 = new Regex(@"(?:(?:(?:05|07|08|10|12)/(?:0[1-9]|[1-2][0-9]|30|31)|(?:04|06|09|11)/(?:0[1-9]|[1-2][0-9]|30)|03/(?:0[7-9]|[1-2][0-9]|30|31))/1273 (?:[0-1][0-9]|2[1-3]):[0-5][0-9]|03/06/1273 (?:1[2-9]|2[0-4]):[0-5][0-9])");
            // правая граница
            Regex r5 = new Regex(@"(?:(?:01/(?:0[1-9]|[1-2][0-9]|30|31)|02/(?:0[1-9]|1[0-9]|2[0-6]))/1978 (?:[0-1][0-9]|2[1-3]):[0-5][0-9]|02/27/1978 (?:[0-1][0-9]:[0-5][0-9]|2[0-1]:(?:[0-2][0-9]|3[0-5])))");

            //Regex r4 = new Regex(@"(?:(?:(?:05|07|08|10|12)/(?:0[1-9]|[1-2][0-9]|30|31)|(?:04|06|09|11)/(?:0[1-9]|[1-2][0-9]|30)|03/(?:0[7-9]|[1-2][0-9]|30|31))/1273)");
            f = true;
            
            // all together
            Regex rezult = new Regex($@"^(((?:(?:(?:(?:(?:01|03|05|07|08|10|12)/(?:0[1-9]|[1-2][0-9]|30|31))|(?:(?:04|06|09|11)/(?:0[1-9]|[1-2][0-9]|30)))/(?:{NonVis.ToString()}|{Vis.ToString()}))|(?:02/(0[1-9]|1[0-9]|2[0-8])/(?:{NonVis.ToString()}))|(?:02/(?:0[1-9]|[1-2][0-9])/(?:{Vis.ToString()})) (?:[0-1][0-9]|2[0-3]):[0-5][0-9]))|((?:(?:(?:05|07|08|10|12)/(?:0[1-9]|[1-2][0-9]|30|31)|(?:04|06|09|11)/(?:0[1-9]|[1-2][0-9]|30)|03/(?:0[7-9]|[1-2][0-9]|30|31))/1273 (?:[0-1][0-9]|2[1-3]):[0-5][0-9]|03/06/1273 (?:1[2-9]|2[0-4]):[0-5][0-9]))|((?:(?:01/(?:0[1-9]|[1-2][0-9]|30|31)|02/(?:0[1-9]|1[0-9]|2[0-6]))/1978 (?:[0-1][0-9]|2[1-3]):[0-5][0-9]|02/27/1978 (?:[0-1][0-9]:[0-5][0-9]|2[0-1]:(?:[0-2][0-9]|3[0-5])))))$");
            //Console.WriteLine(rezult.ToString().Length);
            while (f)
            {
                string tes1 = Console.ReadLine();
                if (rezult.IsMatch(tes1))
                {
                    Console.WriteLine("Right");
                }
                else
                {

                    Console.WriteLine("Wrong");
                }
            }
            Console.ReadLine();
        }
    }
}
